<a href="https://colab.research.google.com/github/julioreis-dev/tutorial_pandas/blob/main/tutorial_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
a = [n for n in range(0, 10)]

In [ ]:
b = [t for t in range(10, 20) ]
c = [a, b]

In [ ]:
serie = pd.Series(c)

In [ ]:
serie1 = pd.DataFrame(c)

In [ ]:
serie

0              [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
1    [10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
dtype: object

In [ ]:
serie1

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19

In [ ]:
b

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [ ]:
c = [z for z in range (20, 30)]

In [ ]:
diclist = {'a':a, 'b':b, 'c':c}

In [ ]:
diclist

{'a': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
 'b': [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
 'c': [20, 21, 22, 23, 24, 25, 26, 27, 28, 29]}

In [ ]:
p = pd.DataFrame(diclist)

In [ ]:
p

   a   b   c
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24
5  5  15  25
6  6  16  26
7  7  17  27
8  8  18  28
9  9  19  29

In [ ]:
p.rename(columns={'a':'Janeiro', 'b':'Fevereiro', 'c': 'Março'})

   Janeiro  Fevereiro  Março
0        0         10     20
1        1         11     21
2        2         12     22
3        3         13     23
4        4         14     24
5        5         15     25
6        6         16     26
7        7         17     27
8        8         18     28
9        9         19     29

In [ ]:
p.shape

(10, 2)

In [ ]:
c = [z for z in range (20, 30)]

In [ ]:
d = [z for z in range (30, 40)]

In [ ]:
columname = ['vt', 'vt1', 'vt2', 'vt3', 'vt4', 'vt5', 'vt6', 'vt7', 'vt8', 'vt9']

In [ ]:
nameindex = ['a', 'b', 'c', 'd']

In [ ]:
frame = pd.DataFrame([a, b, c, d],columns=columname, index=nameindex)

In [ ]:
frame

   vt  vt1  vt2  vt3  vt4  vt5  vt6  vt7  vt8  vt9
a   0    1    2    3    4    5    6    7    8    9
b  10   11   12   13   14   15   16   17   18   19
c  20   21   22   23   24   25   26   27   28   29
d  30   31   32   33   34   35   36   37   38   39

In [99]:
newframe = pd.DataFrame(np.random.randn(60, 3), columns=['Estação1', 'Estação2', 'Estação3'])
newframe.tail()

    Estação1  Estação2  Estação3
55 -0.673386 -0.365836 -1.514275
56  0.135857 -0.441365  0.938235
57  1.199810  0.508977  0.480803
58 -0.092549 -1.296153 -0.592503
59  0.717318  1.498849 -1.053016